BrianLChen/nRF52840-2.4GKeyboard/Application/main.c
    nrf_gpio_cfg_output(PL_Pin);
    nrf_gpio_pin_clear(PL_Pin);

    nrf_gpio_cfg_input(WIRE_MODE_PIN, NRF_GPIO_PIN_PULLUP);
    nrf_gpio_cfg_input(WIRELESS_MODE_PIN, NRF_GPIO_PIN_PULLUP);
    nrf_gpio_cfg_input(BLE_MODE_PIN, NRF_GPIO_PIN_PULLUP);
    nrf_gpio_cfg_input(KNOB_B_PIN, NRF_GPIO_PIN_NOPULL);
    nrf_gpio_cfg_input(KNOB_A_PIN, NRF_GPIO_PIN_NOPULL);

    LED_Off(CAPSLOCK_PIN);
    LED_Off(NUMLOCK_PIN);
    LED_Off(SCRLOCK_PIN);
}

/* Check Mode switch, if value changes, reset the system */
void Check_Mode()
{
    switch (Mode)
    {
    case 1:
        if (nrf_gpio_pin_read(WIRELESS_MODE_PIN) != 0)
        {
            nrf_delay_ms(100);
            NVIC_SystemReset();
        }
        else
        {
            return;
        }
    case 2:
        if (nrf_gpio_pin_read(BLE_MODE_PIN) != 0)
        {
            nrf_delay_ms(100);
            NVIC_SystemReset();
        }
        else
        {
            return;
        }
    case 3:
        if (nrf_gpio_pin_read(WIRE_MODE_PIN) != 0)
        {
            nrf_delay_ms(100);
            NVIC_SystemReset();
        }
        else
        {
            return;
        }
    }
}

// config wake up key before ture into system off mode
void wake_up_key()
{
    nrf_gpio_cfg_input(WAKE_UP_PIN, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_sense_set(WAKE_UP_PIN, NRF_GPIO_PIN_SENSE_HIGH);
}

/* set shut_down weakup event */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    switch (event)
    {
    case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
        wake_up_key();
        break;
    default:
        break;
    }
    return true;
}
/* register wakeup to priority 0 */
NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, 0);

static void Enter_Sleep_Mode()
{
    nrf_gpio_cfg_default(MOS_CTRL_PIN);
    // stop LED indicator
    nrf_gpio_cfg_default(CAPSLOCK_PIN);
    nrf_gpio_cfg_default(NUMLOCK_PIN);
    nrf_gpio_cfg_default(SCRLOCK_PIN);
    // stop other pins
    nrf_gpio_cfg_default(WIRE_MODE_PIN);
    nrf_gpio_cfg_default(WIRELESS_MODE_PIN);
    nrf_gpio_cfg_default(BLE_MODE_PIN);
    nrf_gpio_cfg_default(KNOB_B_PIN);
    nrf_gpio_cfg_default(KNOB_A_PIN);
    nrf_gpio_cfg_default(MOS_CTRL_PIN);

    ws2812_off(RGB_LIGHT);
    ws2812_uninit(RGB_LIGHT);

    nrfx_timer_disable(&TIMER_SLEEP);
    nrfx_spim_uninit(&scan_spi);

    nrf_gzll_disable();
    nrfx_gpiote_uninit();

    nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
}

/* Initial the Scan Timer */
void scan_timer_init(void *scan_func)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;
    nrfx_timer_config_t timer_cfg = NRFX_TIMER_DEFAULT_CONFIG;
    timer_cfg.interrupt_priority = 6;
    err_code = nrfx_timer_init(&TIMER_KBD, &timer_cfg, scan_func);
    APP_ERROR_CHECK(err_code);
    time_ticks = nrfx_timer_us_to_ticks(&TIMER_KBD, 850);
    // Set compare, when counter value = time_ticks -> interrupt
    nrfx_timer_extended_compare(&TIMER_KBD, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    nrfx_timer_enable(&TIMER_KBD);
}

/* Knob GPIOTE callback function */
void KNOB_callback(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    nrf_delay_ms(3);
    // nrf_delay_us(50);
    if (KNOB_SCAN_EN)
    {
        uint32_t B_level = nrf_gpio_pin_read(KNOB_B_PIN);
        if (B_level == 0)
        {
            KNOB_CW = 1;
            KNOB_CCW = 0;
            KNOB_SCAN_EN = 0;
        }
        else
        {
            KNOB_CCW = 1;
            KNOB_CW = 0;
            KNOB_SCAN_EN = 0;
        }
        KNOB_SCAN_EN = 0;
        return;
    }
    else
    {
        KNOB_SCAN_EN = 0;
        return;
    }
    // if (B_level == 0)
    //{
    //     KNOB_CW = 1;
    // }
    // else
    //{
    //     KNOB_CW = 0;
    // }

    // if (B_level != 0)
    //{
    //     KNOB_CCW = 1;
    // }
    // else
    //{
    //     KNOB_CCW = 0;
    // }
}

/* init gpiote for Knob */
static void knob_init(void)
{
    ret_code_t err_code;

    err_code = nrfx_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_RAW_CONFIG_IN_SENSE_HITOLO(true);
    // nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_RAW_CONFIG_IN_SENSE_LOTOHI(true);

    in_config.pull = NRF_GPIO_PIN_NOPULL;

    err_code = nrfx_gpiote_in_init(KNOB_A_PIN, &in_config, KNOB_callback);
    APP_ERROR_CHECK(err_code);

    nrfx_gpiote_in_event_enable(KNOB_A_PIN, true);
}

/**
 * @brief Class specific event handler.
 *
 * @param p_inst    Class instance.
 * @param event     Class specific event.
 * */
static void hid_kbd_user_ev_handler(app_usbd_class_inst_t const *p_inst,
    app_usbd_hid_user_event_t event)
{
    UNUSED_PARAMETER(p_inst);
    switch (event)
    {
    case APP_USBD_HID_USER_EVT_OUT_REPORT_READY:
        /* Only one output report IS defined for HID keyboard class. Update LEDs state. */
        // LED_invert(LED2);
        kbd_status();
        break;
    case APP_USBD_HID_USER_EVT_IN_REPORT_DONE:
        // LED_invert(LED2);
        break;
    case APP_USBD_HID_USER_EVT_SET_BOOT_PROTO:
        UNUSED_RETURN_VALUE(hid_kbd_clear_buffer(p_inst));
        break;
    default:
        break;
    }
}

/**
 * @brief USBD library specific event handler.
 *
 * @param event     USBD library event.
 * */
static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
    switch (event)
    {
    case APP_USBD_EVT_DRV_SOF:
        break;
    case APP_USBD_EVT_DRV_SUSPEND:
        app_usbd_suspend_req(); // Allow the library to put the peripheral into sleep mode
        LED_Off(LED0);
        LED_Off(LED1);
        LED_Off(LED2);
        LED_Off(LED3);
        break;
    case APP_USBD_EVT_DRV_RESUME:
        // bsp_board_led_on(LED_USB_START);
        LED_On(LED3);
        // kbd_status(); /* Restore LED state - during SUSPEND all LEDS are turned off */
        break;
    case APP_USBD_EVT_STARTED:
        // bsp_board_led_on(LED_USB_START);
        LED_On(LED3);
        break;
    case APP_USBD_EVT_STOPPED:
        app_usbd_disable();
        // bsp_board_leds_off();
        LED_Off(LED0);
        LED_Off(LED1);
        LED_Off(LED2);
        LED_Off(LED3);
        break;
    case APP_USBD_EVT_POWER_DETECTED:
        NRF_LOG_INFO("USB power detected");

        if (!nrf_drv_usbd_is_enabled())
        {
            app_usbd_enable();
        }
        break;
    case APP_USBD_EVT_POWER_REMOVED:
        NRF_LOG_INFO("USB power removed");
        app_usbd_stop();
        break;
    case APP_USBD_EVT_POWER_READY:
        NRF_LOG_INFO("USB ready");
        app_usbd_start();
        break;
    default:
        break;
    }
}

