BrianLChen/nRF52840-2.4GKeyboard/Application/main.c
    if ((val & 0x01) != 0)
    {
        LED_On(NUMLOCK_PIN);
    }
    else
    {
        LED_Off(NUMLOCK_PIN);
    }

    if ((val & 0x04) != 0)
    {
        LED_On(SCRLOCK_PIN);
    }
    else
    {
        LED_Off(SCRLOCK_PIN);
    }
}

/**
 * @brief Function to read the button states.
 *
 * @return Returns states of buttons.
 */
static inline void input_get(uint8_t *array)
{
    memset(array, 0, 17);
    nrf_gpio_pin_set(PL_Pin);

    APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));
    memcpy(scan_buff, m_rx_buff, KEY_NUMBER / 8);
    nrf_gpio_pin_clear(PL_Pin);

    uint32_t a = debouncefilter(100);

    memset(&KEYBOARD_Rep_Buff[1], 0, keyboard_rep_byte - 1);
    memset(&CONSUMER_Rep_Buff[1], 0, consumer_rep_byte - 1);

    remap();
    // if Keyboard report buff has changed
    if (memcmp(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1))
    {
        memcpy(array, KEYBOARD_Rep_Buff, keyboard_rep_byte);
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // else if consumer report buffer has changed
    else if (memcmp(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1))
    {
        array[0] = CONSUMER_Rep_Buff[0];
        array[1] = CONSUMER_Rep_Buff[1];
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // if none of the report buffers are change
    else
    {
        nrf_gpio_pin_clear(PL_Pin);
        Check_Mode();
        return;
    }

    memcpy(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1);
    memcpy(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1);
    KNOB_SCAN_EN = 1;
    Check_Mode();
}

/**
 * @brief Initialize the BSP modules.
 */
static void ui_init(void)
{
    uint32_t err_code;

    // Set up logger
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();

    // NRF_LOG_INFO("Gazell ACK payload example. Device mode.");
    NRF_LOG_FLUSH();
}

/* Add scan buffer to fifo */
static void add_pack()
{
    nrf_gpio_pin_set(PL_Pin);

    APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));
    memcpy(scan_buff, m_rx_buff, KEY_NUMBER / 8);

    uint32_t a = debouncefilter(100);

    memset(&KEYBOARD_Rep_Buff[1], 0, keyboard_rep_byte - 1);
    memset(&CONSUMER_Rep_Buff[1], 0, consumer_rep_byte - 1);

    remap();
    // if Keyboard report buff has changed
    if (memcmp(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1))
    {
        // memcpy(array, KEYBOARD_Rep_Buff, keyboard_rep_byte);
        nrf_gzll_add_packet_to_tx_fifo(PIPE_NUMBER, KEYBOARD_Rep_Buff, keyboard_rep_byte);
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // else if consumer report buffer has changed
    else if (memcmp(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1))
    {
        // array[0] = CONSUMER_Rep_Buff[0];
        // array[1] = CONSUMER_Rep_Buff[1];
        nrf_gzll_add_packet_to_tx_fifo(PIPE_NUMBER, CONSUMER_Rep_Buff, consumer_rep_byte);
        Sleep_Time_Out_Counter = 0; // Set sleep counter to 0
    }
    // if none of the report buffers are change
    else
    {

        nrf_gpio_pin_clear(PL_Pin);
        Check_Mode();
        return;
    }

    memcpy(&KEYBOARD_Rep_Buff_Prev[1], &KEYBOARD_Rep_Buff[1], keyboard_rep_byte - 1);
    memcpy(&CONSUMER_Rep_Buff_Prev[1], &CONSUMER_Rep_Buff[1], consumer_rep_byte - 1);
    nrf_gpio_pin_clear(PL_Pin);

    Check_Mode();
}

/*****************************************************************************/
/** @name Gazell callback function definitions  */
/*****************************************************************************/
/**
 * @brief TX success callback.
 *
 * @details If an ACK was received, another packet is sent.
 */
void nrf_gzll_device_tx_success(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info)
{
    bool result_value = false;

    // Load data payload into the TX queue.
    input_get(m_data_payload);

    result_value = nrf_gzll_add_packet_to_tx_fifo(pipe, m_data_payload, TX_PAYLOAD_LENGTH);

    if (!result_value)
    {
        NRF_LOG_ERROR("TX fifo error ");
    }

    uint32_t m_ack_payload_length = NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH;

    if (tx_info.payload_received_in_ack)
    {
        m_ack_payload[0] = 0;
        // Pop packet and write first byte of the payload to the GPIO port.
        result_value = nrf_gzll_fetch_packet_from_rx_fifo(pipe, m_ack_payload, &m_ack_payload_length);
        if (!result_value)
        {
            NRF_LOG_ERROR("RX fifo error ");
        }

        if (m_ack_payload_length > 0)
        {
            output_present(m_ack_payload[0]);
        }
        else
        {
            output_present(0);
        }
    }
    else
    {
        output_present(0);
    }
    gzll_disconnect_counter = 0;
}

/**
 * @brief TX failed callback.
 *
 * @details If the transmission failed, send a new packet.
 *
 * @warning This callback does not occur by default since NRF_GZLL_DEFAULT_MAX_TX_ATTEMPTS
 * is 0 (inifinite retransmits).
 */
void nrf_gzll_device_tx_failed(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info)
{
    // NRF_LOG_ERROR("Gazell transmission failed");

    // Load data into TX queue.
    input_get(m_data_payload);
    bool result_value = nrf_gzll_add_packet_to_tx_fifo(pipe, m_data_payload, TX_PAYLOAD_LENGTH);
    if (!result_value)
    {
        NRF_LOG_ERROR("TX fifo error ");
    }
    if (gzll_disconnect_counter < 50)
    {
        gzll_disconnect_counter += 1;
    }
    else
    {
        m_ack_payload[0] = 0;
        // LED_Off(CAPSLOCK_PIN);
        // LED_Off(NUMLOCK_PIN);
        // LED_Off(SCRLOCK_PIN);
    }
}

/**
 * @brief Gazelle callback.
 * @warning Required for successful Gazell initialization.
 */
void nrf_gzll_host_rx_data_ready(uint32_t pipe, nrf_gzll_host_rx_info_t rx_info)
{
}

/**
 * @brief Gazelle callback.
 * @warning Required for successful Gazell initialization.
 */
void nrf_gzll_disabled()
{
}

// Function to init 2.4G Wireless Mode Keyboard
void Wireless_Mode()
{
    nrf_gpio_cfg_output(MOS_CTRL_PIN);
    nrf_gpio_pin_set(MOS_CTRL_PIN);
    // Set up the user interface (buttons and LEDs).
    ui_init();

