BrianLChen/nRF52840-2.4GKeyboard/Application/main.c
    nrf_pwr_mgmt_init();

    // Initialize Gazell.
    bool result_value = nrf_gzll_init(NRF_GZLL_MODE_DEVICE);
    GAZELLE_ERROR_CODE_CHECK(result_value);
    nrf_gzll_set_timeslot_period(600);

    // set base address for pipe1
    result_value = nrf_gzll_set_base_address_1(0xbc010827);
    GAZELLE_ERROR_CODE_CHECK(result_value);
    result_value = nrf_gzll_set_address_prefix_byte(PIPE_NUMBER, 0x27);
    GAZELLE_ERROR_CODE_CHECK(result_value);

    // set frequency hopping
    nrf_gzll_set_channel_table(Channel_Table, Channel_Table_Size);
    nrf_gzll_set_timeslots_per_channel(3);
    nrf_gzll_set_timeslots_per_channel_when_device_out_of_sync(20);
    nrf_gzll_set_device_channel_selection_policy(NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_CURRENT);
    nrf_gzll_set_sync_lifetime(45);

    // Attempt sending every packet up to MAX_TX_ATTEMPTS times.
    nrf_gzll_set_max_tx_attempts(MAX_TX_ATTEMPTS);

    // input_get(m_data_payload);

    result_value = nrf_gzll_add_packet_to_tx_fifo(PIPE_NUMBER, m_data_payload, TX_PAYLOAD_LENGTH);

    nrfx_timer_config_t timer_cfg = NRFX_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = 9;
    timer_cfg.interrupt_priority = 7;
    nrfx_timer_init(&TIMER_SLEEP, &timer_cfg, Sleep_Counter);
    uint32_t time_ticks = nrfx_timer_ms_to_ticks(&TIMER_SLEEP, 1000);
    // Set compare, when counter value = time_ticks -> interrupt
    nrfx_timer_extended_compare(&TIMER_SLEEP, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    // Enable Gazell to start sending over the air.
    result_value = nrf_gzll_enable();

    nrfx_timer_enable(&TIMER_SLEEP);

    GAZELLE_ERROR_CODE_CHECK(result_value);

    while (true)
    {
        //__WFE();
        ws2812_effect(RGB_LIGHT);
        // uint8_t test = gzp_get_pairing_status();
    }
}

// TODO
void BLE_Mode()
{
    Check_Mode();
}
int main(void)
{
    Pin_Cfg();

    KEYBOARD_Rep_Buff[0] = 0x01;
    KEYBOARD_Rep_Buff_Prev[0] = 0x01;
    CONSUMER_Rep_Buff[0] = 0x02;
    CONSUMER_Rep_Buff_Prev[0] = 0x02;

    m_tx_buff[0] = 0x00;
    m_tx_buff[1] = 0x00;

    nrfx_spim_config_t spi_config = NRFX_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin = SER_APP_SPIM0_SS_PIN;
    spi_config.miso_pin = SER_APP_SPIM0_MISO_PIN;
    spi_config.mosi_pin = NRFX_SPI_PIN_NOT_USED; /* Only Read */
    spi_config.sck_pin = SER_APP_SPIM0_SCK_PIN;
    spi_config.frequency = NRF_SPIM_FREQ_4M;
    nrf_delay_ms(100);

    nrf_gpio_pin_set(PL_Pin);
    APP_ERROR_CHECK(nrfx_spim_init(&scan_spi, &spi_config, NULL, NULL));

    // APP_ERROR_CHECK(nrfx_spim_xfer(&scan_spi, &scan_spi_desc, NULL));

    // input_get(m_data_payload);
    // wake_up_scan(m_data_payload);
    nrf_gpio_pin_clear(PL_Pin);

    ws2812_init(RGB_LIGHT);
    // memset(m_rx_buff, 0, 2);

    knob_init();

    for (;;)
    {
        if (nrf_gpio_pin_read(WIRELESS_MODE_PIN) == 0)
        {
            Mode = 1;
            break;
        }
        else if (nrf_gpio_pin_read(BLE_MODE_PIN) == 0)
        {
            Mode = 2;
            break;
        }
        else if (nrf_gpio_pin_read(WIRE_MODE_PIN) == 0)
        {
            Mode = 3;
            break;
        }
        else
        {
            continue;
        }
    }

    // uint32_t mode = nrf_gpio_pin_read(Mode_Pin);

    if (Mode == 3)
        Wire_Mode();
    else if (Mode == 2)
        Wireless_Mode();
    else if (Mode == 1)
        BLE_Mode();
    else // error
        NVIC_SystemReset();
}